tutorials/cases/PGF_DEM_test/0.orig/Df
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      Df;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 0 0 0];

internalField   uniform (3e+08 0 0 0 3e+08 0 0 0 3e+08);

boundaryField
{
    wallTop
    {
        type            zeroGradient;
    }
    wallSides
    {
        type            zeroGradient;
    }

    wallBottom
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
