tutorials/cases/PGF_DEM_test/0.orig/NI
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      NI;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.;

boundaryField
{
    wallTop
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallSides
    {
        type            zeroGradient;
        type            fluxLimitedGradient;
        Jc              1e-1;
    }
    wallBottom
    {
          type            fixedValue;
        value           uniform 0;
    }

}


// ************************************************************************* //
