tutorials/cases/PGF_DEM_test/0.orig/Ypowder
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ypowder;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    wallTop
    {
        type            zeroGradient;
    }   
    wallSides
    {
        type            zeroGradient;
    }   
    wallBottom
    {   
        type            zeroGradient;
    }

}


// ************************************************************************* //
