tutorials/cases/PGF_DEM_test/0.orig/nParicles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.org";
    object      nParticles;
}

// * if there is a particle in the cell it will receive value 1 if not, 0 * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wallTop
    {
        type            calculated;
        value           uniform 0;
    }
    wallSides
    {
        type            calculated;
        value           uniform 0;
    }

    wallBottom
    {
         type            calculated;
        value           uniform 0;
    }


    procBoundarwallBottomto1
    {
        type            processor;
        value           uniform 0;
    }
}

// ************************************************************************* //

