tutorials/cases/PGF_DEM_test/constant/yadeProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      yadeProperties;
}

active          false;

