tutorials/cases/PGF_DEM_test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousGasificationFoam;

startFrom       latestTime;

startTime       0; 

stopAt          endTime;

endTime         1;

deltaT          1e-06;

writeControl    adjustableRunTime;

writeInterval   0.00005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep no;

maxCo      5; 

maxDi      5000;

libs ("libPorousBCs.so");

functions
{
//    #includeFunc  probes
/*
    avg_NI
    {
        type                fieldValue;
        functionObjectLibs  ("libfieldFunctionObjects.so");
        enabled             true;

        log                 true;          
        writeFields         false;         

        writeControl        timeStep;
        writeInterval       1;

        regionType          all;
        operation           volAverage;

        fields
        (
            NI
        );
    }
*/

}
// ************************************************************************* //
